In [2]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.1-cp39-cp39-macosx_10_9_x86_64.whl (12.6 MB)
     |████████████████████████████████| 12.6 MB 4.7 MB/s eta 0:00:01    |███████████▏                    | 4.4 MB 4.8 MB/s eta 0:00:02     |████████████████████▌           | 8.1 MB 4.8 MB/s eta 0:00:01
Collecting numpy<2,>=1.22.4; python_version < "3.11"
  Downloading numpy-1.26.4-cp39-cp39-macosx_10_9_x86_64.whl (20.6 MB)
     |████████████████████████████████| 20.6 MB 107 kB/s  eta 0:00:01   |██████████▉                     | 7.0 MB 8.6 MB/s eta 0:00:02     |████████████████▌               | 10.6 MB 8.6 MB/s eta 0:00:02     |███████████████████▋            | 12.6 MB 10.8 MB/s eta 0:00:01     |████████████████████▊           | 13.4 MB 10.8 MB/s eta 0:00:01
Collecting tzdata>=2022.7
  Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
     |████████████████████████████████| 345 kB 12.4 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
     |████████████████████████████████| 505 kB 4.9 MB/s eta 0:00:01
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: numpy, tzdata, pytz, pandas
Successfully installed numpy-1.26.4 pandas-2.2.1 pytz-2024.1 tzdata-2024.1
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [5]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     |████████████████████████████████| 249 kB 3.1 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
WARNING: You are using pip version 20.2.3; however, version 24.0 is available.
You should consider upgrading via the '/usr/local/bin/python3.9 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [11]:
#Monthly_reurn include 278 months and 2051 firms (rows)
monthly_return_index_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/ESG_Scores/DS_RI_T_USD_M.xlsx'  # Replace with your Excel file name
df_monthly_return = pd.read_excel(monthly_return_index_path)



#Monthly_capitalization include 278 months and 2051 firms 
monthly_capitalization_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/ESG_Scores/DS_MV_USD_M.xlsx'  # Replace with your Excel file name
df_monthly_capitalization = pd.read_excel(monthly_capitalization_path)



#M ountry to region data
region_path = '/Users/camillevermenouze/Documents/SMTS2/SEF/CountriesToRegions.xlsx'  # Replace with your Excel file name
df_region = pd.read_excel(region_path)

In [13]:
df_region

    % AMER: Cnada + USA               Unnamed: 1 Unnamed: 2
4                  Code                     Name     Region
5                    AE    UNITED ARAB EMIRATES          EM
6                    AR                ARGENTINA         EM
7                    AT                  AUSTRIA        EUR
8                    AU                AUSTRALIA        PAC
..                  ...                      ...        ...
97                   US            UNITED STATES       AMER
98                   VI  VIRGIN ISLANDS, BRITISH      Other
99                   VN                VIET NAM        FRON
100                  ZA            SOUTH AFRICA          EM
101                  ZM                ZIMBABWE          SA

[98 rows x 3 columns]

In [12]:
#let's  keep only the EUR contries

df_region.drop(index=[0,1,2,3], inplace= True )

df_EUR = df_region[df_region['Unnamed: 2'] == 'EUR']

#Rename the column so we can merge later
df_EUR = df_EUR.rename(columns={'% AMER: Cnada + USA' : 'ISIN_First2'})

print(df_EUR)

   ISIN_First2       Unnamed: 1 Unnamed: 2
7           AT          AUSTRIA        EUR
11          BE          BELGIUM        EUR
19          CH      SWITZERLAND        EUR
26          DE          GERMANY        EUR
27          DK          DENMARK        EUR
30          ES            SPAIN        EUR
31          FI          FINLAND        EUR
32          FR          FRANCE         EUR
33          GB  UNITED KINGDOM         EUR
43          IE          IRELAND        EUR
44          IL          ISRAEL         EUR
48          IT            ITALY        EUR
71          NL      NETHERLANDS        EUR
72          NO          NORWAY         EUR
80          PT        PORTUGAL         EUR
87          SE          SWEDEN         EUR

In [15]:
#Now merged with the two dataset 
#First step we need to create a new columns with only the 2 first characters of the columns ISIN

#First with the return data 

df_monthly_return['ISIN_First2'] = df_monthly_return ['ISIN'].str[:2]
df_monthly_return.head()

,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,2000-06-30 00:00:00,2000-07-31 00:00:00,2000-08-31 00:00:00,...,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00,ISIN_First2
0,AN8068571086,SCHLUMBERGER,1858.26,2254.15,2334.75,2336.65,2245.09,2283.70,2262.67,2610.77,...,3603.19,4261.29,3315.58,3433.33,3537.17,3344.15,4846.68,4801.97,4997.02,AN
1,ARALUA010258,ALUAR,1820.11,1911.12,1866.11,1835.93,1805.22,1657.42,1911.95,1982.99,...,4024.78,3845.16,3472.87,5651.92,5459.78,4847.48,4827.59,5377.66,5524.11,AR
2,ARP125991090,BBVA BANCO FRANCES,396.54,467.49,418.37,350.66,352.52,401.75,404.48,398.47,...,185.10,185.83,170.00,224.44,242.69,242.21,225.97,240.64,299.57,AR
3,ARSIDE010029,TERNIUM ARGENTINA SOCIEDAD ANONIMA,177.53,184.55,184.16,171.05,112.65,120.55,124.93,137.21,...,1141.96,1055.43,1025.82,1373.67,1428.06,1263.78,1286.25,1257.52,1463.58,AR
4,AT00000VIE62,FLUGHAFEN WIEN,156.25,153.83,158.62,137.27,148.95,159.68,151.08,153.35,...,1044.97,1035.49,1258.39,1229.26,1215.93,1190.06,1198.76,1248.90,1269.03,AT

In [16]:
#With the capitalization now
df_monthly_capitalization['ISIN_First2'] = df_monthly_capitalization ['ISIN'].str[:2]
df_monthly_capitalization.head()

,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,2000-06-30 00:00:00,2000-07-31 00:00:00,2000-08-31 00:00:00,...,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00,ISIN_First2
0,AN8068571086,SCHLUMBERGER,33574.85,40611.13,43352.43,43387.86,41861.39,42466.02,42074.79,48547.80,...,55139.08,64962.64,50578.51,52374.81,53958.90,50906.19,73778.56,73097.94,75806.25,AN
1,ARALUA010258,ALUAR,1328.64,1395.07,1362.23,1340.19,1317.78,1209.89,1395.69,1447.55,...,2195.00,2097.04,1894.01,3013.90,2911.44,2584.93,2574.33,2778.90,2853.52,AR
2,ARP125991090,BBVA BANCO FRANCES,1570.39,1851.34,1656.82,1388.70,1352.22,1541.05,1551.54,1528.48,...,1081.26,1085.52,993.08,1227.99,1318.36,1308.06,1206.71,1285.05,1591.32,AR
3,ARSIDE010029,TERNIUM ARGENTINA SOCIEDAD ANONIMA,1407.47,1463.08,1460.01,1356.04,893.05,955.70,990.45,1087.76,...,4778.90,4416.77,4292.86,5748.56,5673.71,5021.04,5110.32,4996.17,5814.86,AR
4,AT00000VIE62,FLUGHAFEN WIEN,567.85,559.05,576.48,498.86,517.64,554.94,525.07,532.96,...,2388.16,2366.48,2875.89,2809.31,2778.87,2719.75,2739.62,2854.20,2900.21,AT

In [18]:
#Second step we merge the data set with the region, keeping only the one matching the EUR countries
df_EUR_monthly_capitalization = pd.merge(df_EUR,  df_monthly_capitalization, on='ISIN_First2', how='inner')
df_EUR_monthly_return = pd.merge(df_EUR,  df_monthly_return, on='ISIN_First2', how='inner')

In [19]:
df_EUR_monthly_capitalization.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,567.85,559.05,576.48,498.86,517.64,...,2453.36,2388.16,2366.48,2875.89,2809.31,2778.87,2719.75,2739.62,2854.20,2900.21
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,1803.98,1857.91,1910.40,1827.24,1810.26,...,15823.98,13448.16,13356.15,10873.35,10824.56,9715.28,9532.79,10602.50,13099.32,13715.54
2,AT,AUSTRIA,EUR,AT0000743059,OMV,2583.84,2113.74,2065.10,2223.10,2305.32,...,15799.81,16951.82,19071.10,15313.75,13821.87,13255.37,11981.47,15085.69,16902.76,16800.81
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,1655.07,1781.21,1618.73,1446.45,1554.72,...,18088.45,18353.60,16894.99,16612.75,18659.53,16321.45,14584.20,13333.42,15082.96,14289.58
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,1386.43,1283.95,1428.44,1487.43,1567.26,...,3511.64,3280.93,3173.55,2466.15,2635.59,2703.34,2324.62,2634.32,2896.84,2690.25

In [20]:
df_EUR_monthly_return.head()

,ISIN_First2,Unnamed: 1,Unnamed: 2,ISIN,NAME,2000-01-31 00:00:00,2000-02-29 00:00:00,2000-03-31 00:00:00,2000-04-30 00:00:00,2000-05-31 00:00:00,...,2022-03-31 00:00:00,2022-04-30 00:00:00,2022-05-31 00:00:00,2022-06-30 00:00:00,2022-07-31 00:00:00,2022-08-31 00:00:00,2022-09-30 00:00:00,2022-10-31 00:00:00,2022-11-30 00:00:00,2022-12-31 00:00:00
0,AT,AUSTRIA,EUR,AT00000VIE62,FLUGHAFEN WIEN,156.25,153.83,158.62,137.27,148.95,...,1073.50,1044.97,1035.49,1258.39,1229.26,1215.93,1190.06,1198.76,1248.90,1269.03
1,AT,AUSTRIA,EUR,AT0000652011,ERSTE GROUP BANK,94.91,97.74,100.50,96.13,97.86,...,567.30,482.13,504.75,410.92,409.07,367.15,360.26,400.68,495.04,518.33
2,AT,AUSTRIA,EUR,AT0000743059,OMV,389.64,318.75,311.41,335.24,356.91,...,4277.87,4589.77,5163.58,4341.76,3918.78,3758.17,3396.99,4277.10,4792.28,4763.37
3,AT,AUSTRIA,EUR,AT0000746409,VERBUND,524.60,564.59,518.56,463.37,498.05,...,8285.25,8406.71,7820.72,7690.07,8637.53,7555.23,6751.05,6172.06,6981.93,6614.67
4,AT,AUSTRIA,EUR,AT0000831706,WIENERBERGER,2379.46,2203.58,2451.55,2552.81,2746.80,...,6331.35,5915.37,5895.80,4581.59,4896.37,5022.24,4318.66,4894.01,5548.18,5152.51

In [21]:
df_EUR_monthly_capitalization.to_csv('/Users/camillevermenouze/Documents/SMTS2/SEF/df_EUR_monthly_capitalization.csv', index=False)
df_EUR_monthly_return.to_csv('/Users/camillevermenouze/Documents/SMTS2/SEF/df_EUR_monthly_return.csv', index=False)
#We have now 508 firms with the data for 281 months